# Даны значения зарплат из выборки выпускников: 
# 100, 80, 75, 77, 89, 33, 45, 25, 65, 17, 30, 24, 57, 55, 70, 75, 65, 84, 90, 150. 
# Посчитать (желательно без использования статистических методов наподобие std, var, mean) среднее арифметическое, 
# среднее квадратичное отклонение, смещенную и несмещенную оценки дисперсий для данной выборки.
import numpy as np

x = np.array([100, 80, 75, 77, 89, 33, 45, 25, 65, 17, 30, 24, 57, 55, 70, 75, 65, 84, 90, 150])
x.sort()
# Среднее арифметическое
average = (x[0]+x[1]+x[2]+x[3]+x[4]+x[5]+x[6]+x[7]
+x[8]+x[9]+x[10]+x[11]+x[12]+x[13]+x[14]+x[15]+x[16]+x[17]+x[18]+x[19])/len(x)
print(f'Среднее арифметическое = {average}')
print('─' * 10)
# Смещенная дисперсия для выборки
biased_variance = (((x[0]-average)**2)+((x[1]-average)**2)+((x[2]-average)**2)+((x[3]-average)**2)+((x[4]-average)**2)
+((x[5]-average)**2)+((x[6]-average)**2)+((x[7]-average)**2)+((x[8]-average)**2)+((x[9]-average)**2)+((x[10]-average)**2)
+((x[11]-average)**2)+((x[12]-average)**2)+((x[13]-average)**2)+((x[14]-average)**2)+((x[15]-average)**2)
+((x[16]-average)**2)+((x[17]-average)**2)+((x[18]-average)**2)+((x[19]-average)**2))/len(x)
print(f'Cмещенная дисперсия для выборки = {biased_variance}')
# Cреднее квадратичное отклонение (смещенная дисперсия)
mean_sqr_dev = biased_variance**0.5
print(f'Cреднее квадратичное отклонение (смещенная дисперсия) = {round(mean_sqr_dev,2)}')

print('─' * 10)

# Несмещенная дисперсия для выборки        
unbiased_variance = (((x[0]-average)**2)+((x[1]-average)**2)+((x[2]-average)**2)+((x[3]-average)**2)+((x[4]-average)**2)
+((x[5]-average)**2)+((x[6]-average)**2)+((x[7]-average)**2)+((x[8]-average)**2)+((x[9]-average)**2)+((x[10]-average)**2)
+((x[11]-average)**2)+((x[12]-average)**2)+((x[13]-average)**2)+((x[14]-average)**2)+((x[15]-average)**2)
+((x[16]-average)**2)+((x[17]-average)**2)+((x[18]-average)**2)+((x[19]-average)**2))/(len(x)-1)
print(f'Несмещенная дисперсия для выборки = {round(unbiased_variance,2)}')

# Cреднее квадратичное отклонение (несмещенная дисперсия)
mean_sqr_dev_2 = unbiased_variance**0.5
print(f'Cреднее квадратичное отклонение (несмещенная дисперсия) = {round(mean_sqr_dev_2,2)}')